app/controllers/students_controller.rb

    def index
        # render text: "you owes me 2 pongs"
        @students = Student.all
---
SELECT  "students".* FROM "students" ORDER BY "students"."id" DESC LIMIT ?  [["LIMIT", 1]]